Table of Contents
 Class SectionConcreteCheckResult
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ection concrete result
public class SectionConcreteCheckResult
Inheritance
object
SectionConcreteCheckResult
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SectionConcreteCheckResult()
Constructor
public SectionConcreteCheckResult()
Properties
 ExtremeResults
Extreme results
public List<ConcreteCheckResults> ExtremeResults { get; set; }
Property Value
List<ConcreteCheckResults>
 SectionId
Id Of section
public int SectionId { get; set; }
Property Value
int
 Edit this page